share/tutorials/incompressible/pimple/elipse_kkl_omega/0/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (3.1 0 0);

boundaryField
{
  outlet
  {
   type             inletOutlet;
   inletValue       uniform (0 0 0);
   inlet            uniform (0 0 0);
  }
  inlet
  {
    type            fixedValue;
    value           uniform (3.1 0 0);
  }
  up
  {
    type            symmetry;
  }
  hole
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
