share/tutorials/incompressible/pimple/elipse_kkl_omega/0/kl
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      kl;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform 0;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      uniform 0;
    value           uniform 0;
  }
  up
  {
    type            symmetry;
  }
  hole
  {
    type            fixedValue;
    value           uniform 0;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
