share/tutorials/incompressible/pimple/elipse_kkl_omega/system/createPatchDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      createPatchDict;
}

pointSync false;
patches
(
  {
    // Name of new patch
    name inlet;
    // Dictionary to construct new patch from
    patchInfo
    {
      type patch;
    }
    // How to construct: either from 'patches' or 'set'
    constructFrom set;
    // If constructFrom = set : name of faceSet
    set f0;
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
