share/tutorials/incompressible/pimple/elipse_kkl_omega/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       1e-06;
    relTol          0.01;
    smoother        DICGaussSeidel;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
  }
  pFinal
  {
    $p;
    tolerance       1e-06;
    relTol          0;
  }
  "(U|kl|kt|omega)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-06;
    relTol          0.01;
  }
  "(U|kl|kt|omega)Final"
  {
    $U;
    tolerance       1e-06;
    relTol          0;
  }
}
PIMPLE
{
  nOuterCorrectors    1;
  nCorrectors         2;
  nNonOrthogonalCorrectors 1;
  pRefCell            0;
  pRefValue           0;
}
relaxationFactors
{
  equations
  {
    ".*"            1;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
