share/tutorials/incompressible/pimple/elipse_kkl_omega/system/mirrorMeshDict
// -*- c++ -*-
// mousse: CFD toolbox (v.0.1.0)
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      mirrorMeshDict;
}
// ---

planeType pointAndNormal;

pointAndNormalDict
{
  basePoint ( 0 0 0 );
  normalVector ( 0 -1 0 );
}

planeTolerance 1e-06;

// vim: set ft=foam et sw=2 ts=2 sts=2:
